[
  {
    "rfc_number": "9887",
    "rfc_title": "Terminal Access Controller Access-Control System Plus (TACACS+) over TLS 1.3",
    "content": "1. Introduction\n\n   \"The Terminal Access Controller Access-Control System Plus (TACACS+)\n   Protocol\" [RFC8907] provides device administration for routers,\n   network access servers, and other networked computing devices via one\n   or more centralized TACACS+ servers.  The protocol provides\n   authentication, authorization, and accounting services (AAA) for\n   TACACS+ clients within the device administration use case.\n\n   The content of the protocol is highly sensitive and requires secure\n   transport to safeguard a deployment.  However, TACACS+ lacks\n   effective confidentiality, integrity, and authentication of the\n   connection and network traffic between the TACACS+ server and client.\n   The security mechanisms as described in Section 4.5 of [RFC8907] are\n   extremely weak.\n\n   To address these deficiencies, this document updates the TACACS+\n   protocol to use TLS 1.3 authentication and encryption [RFC8446], and\n   obsoletes the use of TACACS+ obfuscation mechanisms.  The maturity of\n   TLS in version 1.3 and above makes it a suitable choice for the\n   TACACS+ protocol.\n\n2. Technical Definitions\n\n   The terms defined in Section 3 of [RFC8907] are fully applicable here\n   and will not be repeated.  The following terms are also used in this\n   document.\n\n   Obfuscation:  TACACS+ was originally intended to incorporate a\n      mechanism for securing the body of its packets.  The algorithm is\n      categorized as obfuscation in Section 10.5.2 of [RFC8907].  The\n      term is used to ensure that the algorithm is not mistaken for\n      encryption.  It should not be considered secure.\n\n   Non-TLS connection:  This term refers to the connection defined in\n      [RFC8907].  It is a connection without TLS, using the unsecure\n      TACACS+ authentication and obfuscation (or the unobfuscated option\n      for testing).  The use of well-known TCP/IP host port number 49 is\n      specified as the default for non-TLS connections.\n\n   TLS connection:  A TLS connection is a TCP/IP connection with TLS\n      authentication and encryption used by TACACS+ for transport.  A\n      TLS connection for TACACS+ is always between one TACACS+ client\n      and one TACACS+ server.\n\n   TLS TACACS+ server:  This document describes a variant of the TACACS+\n      server, introduced in Section 3.2 of [RFC8907], which utilizes TLS\n      for transport, and makes some associated protocol optimizations.\n      Both server variants respond to TACACS+ traffic, but this document\n      specifically defines a TACACS+ server (whether TLS or non-TLS) as\n      being bound to a specific port number on a particular IP address\n      or hostname.  This definition is important in the context of the\n      configuration of TACACS+ clients to ensure they direct their\n      traffic to the correct TACACS+ servers.\n\n   Peer:  The peer of a TACACS+ client (or server) in the context of a\n      TACACS+ connection, is a TACACS+ server (or client).  Together,\n      the ends of a TACACS+ connection are referred to as peers.\n\n2.1. Requirements Language\n\n   The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\",\n   \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"NOT RECOMMENDED\", \"MAY\", and\n   \"OPTIONAL\" in this document are to be interpreted as described in BCP 14 [RFC2119] [RFC8174] when, and only when, they appear in all\n   capitals, as shown here.\n\n\n3. TACACS+ over TLS\n\n   TACACS+ over TLS takes the protocol defined in [RFC8907], removes the\n   option for obfuscation, and specifies that TLS 1.3 be used for\n   transport (Section 3.1 elaborates on TLS version support).  A new\n   well-known default host port number is used.  The next sections\n   provide further details and guidance.\n\n   TLS is introduced into TACACS+ to fulfill the following requirements:\n\n   1.  Confidentiality and Integrity: The MD5 algorithm underlying the\n       obfuscation mechanism specified in [RFC8907] has been shown to be\n       insecure [RFC6151] when used for encryption.  This prevents\n       TACACS+ from being used in a deployment compliant with\n       [FIPS-140-3].  Securing the TACACS+ protocol with TLS is intended\n       to provide confidentiality and integrity without requiring the\n       provision of a secured network.\n\n   2.  Peer authentication: The authentication capabilities of TLS\n       replace the shared secrets of obfuscation for mutual\n       authentication.\n\n   This document adheres to the recommendations in [REQ-TLS13].\n\n3.1. Separating TLS Connections\n\n   Peers implementing the TACACS+ protocol variant defined in this\n   document MUST apply mutual authentication and encrypt all data\n   exchanged between them.  Therefore, when a TCP connection is\n   established for the service, a TLS handshake begins immediately.\n   Options that upgrade an initial non-TLS connection MUST NOT be used;\n   see Section 5.3.\n\n   To ensure clear separation between TACACS+ traffic using TLS and that\n   which does not (see Section 5.3), servers supporting TACACS+ over TLS\n   MUST listen on a TCP/IP port distinct from that used by non-TLS\n   TACACS+ servers.  It is further RECOMMENDED to deploy the TLS and\n   non-TLS services on separate hosts, as discussed in Section 5.1.1.\n\n   Given the prevalence of default port usage in existing TACACS+ client\n   implementations, this specification assigns the well-known TCP port\n   number 300 for TACACS+ over TLS (see Section 7).\n\n   While the use of the designated port number is strongly encouraged,\n   deployments with specific requirements MAY use alternative TCP port\n   numbers.  In such cases, operators must carefully consider the\n   operational implications described in Section 5.3.\n\n\n3.2. TLS Connection\n\n   A TACACS+ client initiates a TLS connection by making a TCP\n   connection to a configured TLS TACACS+ server on the TACACS+ TLS port\n   number.  Once the TCP connection is established, the client MUST\n   immediately begin the TLS negotiation before sending any TACACS+\n   protocol data.\n\n   A minimum of TLS 1.3 [RFC8446] MUST be used for transport.  It is\n   expected that TACACS+, as described in this document, will work with\n   future versions of TLS.  Earlier versions of TLS MUST NOT be used.\n\n   Once the TLS connection has been successfully established, the\n   exchange of TACACS+ data MUST proceed in accordance with the\n   procedures defined in [RFC8907].  However, all TACACS+ messages SHALL\n   be transmitted as TLS application data.  The TACACS+ obfuscation\n   mechanism defined in [RFC8907] MUST NOT be applied when operating\n   over TLS (Section 4).\n\n   TLS TACACS+ connections are generally not long-lived.  The connection\n   will be closed by either a peer if it encounters an error or an\n   inactivity timeout.\n\n   For connections not operating in Single Connection Mode (as defined\n   in Section 4.3 of [RFC8907]), the TCP session SHALL be closed upon\n   completion of the associated TACACS+ session.  Connections operating\n   in Single Connection Mode MAY persist for a longer duration but are\n   typically subject to timeout and closure after a brief period of\n   inactivity.  Consequently, support for transport-layer keepalive\n   mechanisms is not required.\n\n   Why a connection is closed has no bearing on TLS resumption, unless\n   closed by a TLS error, in which case it is possible that the ticket\n   has been invalidated.\n\n   TACACS+ clients and servers widely support IPv6 configuration in\n   addition to IPv4.  This document makes no changes to recommendations\n   in this area.\n\n\n3.3. TLS Authentication Options\n\n   Implementations MUST support certificate-based mutual authentication,\n   to provide a core option for interoperability between deployments.\n   This authentication option is specified in Section 3.4.\n\n   In addition to certificate-based TLS authentication, implementations\n   MAY support the following alternative authentication mechanisms:\n\n   *  Pre-Shared Keys (PSKs) (Section 3.5), also known as external PSKs\n      in TLS 1.3.\n\n   *  Raw Public Keys (RPKs).  The details of RPKs are considered out of\n      scope for this document.  Refer to [RFC7250] and Section 4.4.2 of\n      [RFC8446] for implementation, deployment, and security\n      considerations.\n\n\n3.4. TLS Certificate-Based Authentication\n\n   TLS certificate authentication is the primary authentication option\n   for TACACS+ over TLS.  This section covers certificate-based\n   authentication only.\n\n   Deploying TLS certificate-based authentication correctly will\n   considerably improve the security of TACACS+ deployments.  It is\n   essential for implementers and operators to understand the\n   implications of a TLS certificate-based authentication solution,\n   including the correct handling of certificates, Certificate\n   Authorities (CAs), and all elements of TLS configuration.  For\n   guidance, start with [BCP195].\n\n   Each peer MUST validate the certificate path of its remote peer,\n   including revocation checking, as described in Section 3.4.1.\n\n   If the verification succeeds, the authentication is successful and\n   the connection is permitted.  Policy may impose further constraints\n   upon the peer, allowing or denying the connection based on\n   certificate fields or any other parameters exposed by the\n   implementation.\n\n   Unless disabled by configuration, a peer MUST NOT permit connection\n   of any peer that presents an invalid TLS certificate.\n\n3.4.1. TLS Certificate Path Verification\n\n   The implementation of certificate-based mutual authentication MUST\n   support certificate path validation as described in Section 6 of\n   [RFC5280].\n\n   In some deployments, a peer may be isolated from a remote peer's CA.\n   Implementations for these deployments MUST support certificate chains\n   (aka bundles or chains of trust), where the entire chain of the\n   remote peer's certificate is stored on the local peer.\n\n   TLS Cached Information Extension [RFC7924] SHOULD be implemented.\n   This MAY be augmented with RPKs [RFC7250], though revocation must be\n   handled as it is not part of that specification.\n\n   Other approaches may be used for loading the intermediate\n   certificates onto the client, but they MUST include support for\n   revocation checking.  For example, [RFC5280] details the Authority\n   Information Access (AIA) extension to provide information about the\n   issuer of the certificate in which the extension appears.  It can be\n   used to provide the address of the Online Certificate Status Protocol\n   (OCSP) responder from where the revocation status of the certificate\n   (which includes the extension) can be checked.\n\n\n3.4.2. TLS Certificate Identification\n\n   For the client-side validation of presented TLS TACACS+ server\n   identities, implementations MUST follow the validation techniques\n   defined in [RFC9525].  Identifier types DNS-ID, IP-ID, or SRV-ID are\n   applicable for use with the TLS TACACS+ protocol; they are selected\n   by operators depending upon the deployment design.  TLS TACACS+ does\n   not use URI-IDs for TLS TACACS+ server identity verification.\n\n   Wildcards in TLS TACACS+ server identities simplify certificate\n   management by allowing a single certificate to secure multiple\n   servers in a deployment.  However, this introduces security risks, as\n   compromising the private key of a wildcard certificate impacts all\n   servers using it.  To address these risks, the guidelines in Section 6.3 of [RFC9525] MUST be followed, and the wildcard SHOULD be\n   confined to a subdomain dedicated solely to TACACS+ servers.\n\n   For the TLS TACACS+ server-side validation of client identities,\n   implementations MUST support the ability to configure which fields of\n   a certificate are used for client identification to verify that the\n   client is a valid source for the received certificate and that it is\n   permitted access to TACACS+. Implementations MUST support either:\n\n   *  Network-address-based validation methods as described in Section 5.2 of [RFC5425] or\n\n   *  Client Identity validation of a shared identity in the certificate\n      subjectAltName.  This is applicable in deployments where the\n      client securely supports an identity which is shared with the TLS\n      TACACS+ server.  Matching of dNSName and iPAddress MUST be\n      supported.  Other options defined in Section 4.2.1.6 of [RFC5280]      MAY be supported.  This approach allows a client's network\n      location to be reconfigured without issuing a new client\n      certificate.\n\n   Implementations MUST support the TLS Server Name Indication (SNI)\n   extension (Section 3 of [RFC6066]).  TLS TACACS+ clients MUST support\n   the ability to configure the TLS TACACS+ server's domain name, so\n   that it may be included in the SNI \"server_name\" extension of the\n   client hello (This is distinct from the IP Address or hostname\n   configuration used for the TCP connection).  Refer to Section 5.1.5   for security related operator considerations.\n\n   Certificate provisioning is out of scope of this document.\n\n\n3.4.3. Cipher Suites Requirements\n\n   Implementations MUST support the TLS 1.3 mandatory cipher suites\n   (Section 9.1 of [RFC8446]).  Readers should refer to [BCP195].  The\n   cipher suites offered or accepted SHOULD be configurable so that\n   operators can adapt.\n\n\n\n3.5. TLS PSK Authentication\n\n   As an alternative to certificate-based authentication,\n   implementations MAY support PSKs, also known as external PSKs in TLS\n   1.3 [RFC8446].  These should not be confused with resumption PSKs.\n\n   The use of external PSKs is less well established than certificate-\n   based authentication.  It is RECOMMENDED that systems follow the\n   directions of [RFC9257] and Section 4 of [RFC8446].\n\n   Where PSK authentication is implemented, PSK lengths of at least 16\n   octets MUST be supported.\n\n   PSK identity MUST follow recommendations of Section 6.1 of [RFC9257].\n   Implementations MUST support PSK identities of at least 16 octets.\n\n   Although this document removes the option of obfuscation (Section 4),\n   it is still possible that the TLS and non-TLS versions of TACACS+\n   exist in an organization, for example, during migration\n   (Section 6.1).  In such cases, the shared secrets configured for\n   TACACS+ obfuscation clients MUST NOT be the same as the PSKs\n   configured for TLS clients.\n\n\n3.6. TLS Resumption\n\n   TLS Resumption [RFC8446] can minimize the number of round trips\n   required during the handshake process.  If a TLS client holds a\n   ticket previously extracted from a NewSessionTicket message from the\n   TLS TACACS+ server, it can use the PSK identity tied to that ticket.\n   If the TLS TACACS+ server consents, the resumed session is\n   acknowledged as authenticated and securely linked to the initial\n   session.\n\n   The client SHOULD use resumption when it holds a valid unused ticket\n   from the TLS TACACS+ server, as each ticket is intended for a single\n   use only and will be refreshed during resumption.  The TLS TACACS+\n   server can reject a resumption request, but the TLS TACACS+ server\n   SHOULD allow resumption if the ticket in question has not expired and\n   has not been used before.\n\n   When a TLS TACACS+ server is presented with a resumption request from\n   the TLS client, it MAY still choose to require a full handshake.  In\n   this case, the negotiation proceeds as if the session was a new\n   authentication, and the resumption attempt is ignored.  As described\n   in Appendix C.4 of [RFC8446], reuse of a ticket allows passive\n   observers to correlate different connections.  TLS TACACS+ clients\n   and servers SHOULD follow the client tracking preventions in Appendix C.4 of [RFC8446].\n\n   When processing TLS resumption, certificates must be verified to\n   check for revocation during the period since the last\n   NewSessionTicket Message.\n\n   The resumption ticket_lifetime SHOULD be configurable, including a\n   zero seconds lifetime.  Refer to Section 4.6.1 of [RFC8446] for\n   guidance on ticket lifetime.\n\n\n4. Obsolescence of TACACS+ Obfuscation\n\n   The obfuscation mechanism documented in Section 4.5 of [RFC8907] is\n   weak.\n\n   The introduction of TLS authentication and encryption to TACACS+\n   replaces this former mechanism, so obfuscation is hereby obsoleted.\n   This section describes how the TACACS+ client and servers MUST\n   operate regarding the obfuscation mechanism.\n\n   Peers MUST NOT use obfuscation with TLS.\n\n   A TACACS+ client initiating a TACACS+ TLS connection MUST set the\n   TAC_PLUS_UNENCRYPTED_FLAG bit, thereby asserting that obfuscation is\n   not used for the session.  All subsequent packets MUST have the\n   TAC_PLUS_UNENCRYPTED_FLAG bit set to 1.\n\n   A TLS TACACS+ server that receives a packet with the\n   TAC_PLUS_UNENCRYPTED_FLAG bit not set to 1 over a TLS connection MUST\n   return an error of TAC_PLUS_AUTHEN_STATUS_ERROR,\n   TAC_PLUS_AUTHOR_STATUS_ERROR, or TAC_PLUS_ACCT_STATUS_ERROR as\n   appropriate for the TACACS+ message type, with the\n   TAC_PLUS_UNENCRYPTED_FLAG bit set to 1, and terminate the session.\n   This behavior corresponds to that defined in Section 4.5 of [RFC8907]   regarding data obfuscation for TAC_PLUS_UNENCRYPTED_FLAG or key\n   mismatches.\n\n   A TACACS+ client that receives a packet with the\n   TAC_PLUS_UNENCRYPTED_FLAG bit not set to 1 MUST terminate the\n   session, and SHOULD log this error.\n\n5. Security Considerations\n\n\n\n\n\n5.1. TLS\n\n   This document improves the confidentiality, integrity, and\n   authentication of the connection and network traffic between TACACS+\n   peers by adding TLS support.\n\n   Simply adding TLS support to the protocol does not guarantee the\n   protection of the TLS TACACS+ server and clients.  It is essential\n   for the operators and equipment vendors to adhere to the latest best\n   practices for ensuring the integrity of network devices and selecting\n   secure TLS key and encryption algorithms.\n\n   [BCP195] offers substantial guidance for implementing and deploying\n   protocols that use TLS.  Those implementing and deploying Secure\n   TACACS+ must adhere to the recommendations relevant to TLS 1.3\n   outlined in [BCP195] or its subsequent versions.\n\n   This document outlines additional restrictions permissible under\n   [BCP195].  For example, any recommendations referring to TLS 1.2,\n   including the mandatory support, are not relevant for Secure TACACS+,\n   as TLS 1.3 or above is mandated.\n\n   This document concerns the use of TLS as transport for TACACS+ and\n   does not make any changes to the core TACACS+ protocol, other than\n   the direct implications of deprecating obfuscation.  Operators MUST\n   be cognizant of the security implications of the TACACS+ protocol\n   itself.  Further documents are planned, for example, to address the\n   security implications of password-based authentication and enhance\n   the protocol to accommodate alternative schemes.\n\n5.1.1. TLS Use\n\n   New TACACS+ production deployments SHOULD use TLS authentication and\n   encryption.  Also see [RFC3365].\n\n   TLS TACACS+ servers (as defined in Section 2) MUST NOT allow non-TLS\n   connections, because of the threat of downgrade attacks or\n   misconfiguration described in Section 5.3.  Instead, separate non-TLS\n   TACACS+ servers SHOULD be set up to cater for these clients.\n\n   It is NOT RECOMMENDED that TLS TACACS+ servers and non-TLS TACACS+\n   servers be deployed on the same host, for reasons discussed in Section 5.3.  Non-TLS connections would be better served by deploying\n   the required non-TLS TACACS+ servers on separate hosts.\n\n   TACACS+ clients MUST NOT fail back to a non-TLS connection if a TLS\n   connection fails.  This prohibition includes during the migration of\n   a deployment (Section 6.1).\n\n\n5.1.2. TLS 0-RTT\n\n   TLS 1.3 resumption and PSK techniques make it possible to send early\n   data, aka 0-RTT data, data that is sent before the TLS handshake\n   completes.  Replay of this data is a risk.  Given the sensitivity of\n   TACACS+ data, clients MUST NOT send data until the full TLS handshake\n   completes; that is, clients MUST NOT send 0-RTT data and TLS TACACS+\n   servers MUST abruptly disconnect clients that do.\n\n   TLS TACACS+ clients and servers MUST NOT include the \"early_data\"\n   extension.  See Sections 2.3 and 4.2.10 of [RFC8446] for security\n   concerns.\n\n\n5.1.3. TLS Options\n\n   Recommendations in [BCP195] MUST be followed to determine which TLS\n   versions and algorithms should be supported, deprecated, obsoleted,\n   or abandoned.\n\n   Also, Section 9 of [RFC8446] prescribes mandatory supported options.\n\n\n5.1.4. Unreachable Certificate Authority (CA)\n\n   Operators should be cognizant of the potential of TLS TACACS+ server\n   and/or client isolation from their peer's CA by network failures.\n   Isolation from a public key certificate's CA will cause the\n   verification of the certificate to fail and thus TLS authentication\n   of the peer to fail.  The approach mentioned in Section 3.4.1 can\n   help address this and should be considered.\n\n\n5.1.5. TLS Server Name Indicator (SNI)\n\n   Operators should be aware that the TLS SNI extension is part of the\n   TLS client hello, which is sent in cleartext.  It is, therefore,\n   subject to eavesdropping.  Also see Section 11.1 of [RFC6066].\n\n\n5.1.6. Server Identity Wildcards\n\n   The use of wildcards in TLS server identities creates a single point\n   of failure: a compromised private key of a wildcard certificate\n   impacts all servers using it.  Their use MUST follow the\n   recommendations of Section 7.1 of [RFC9525].  Operators MUST ensure\n   that the wildcard is limited to a subdomain dedicated solely to TLS\n   TACACS+ servers.  Further, operators MUST ensure that the TLS TACACS+\n   servers covered by a wildcard certificate are impervious to\n   redirection of traffic to a different server (for example, due to on-\n   path attacks or DNS cache poisoning).\n\n\n\n5.2. TACACS+ Configuration\n\n   Implementors must ensure that the configuration scheme introduced for\n   enabling TLS is straightforward and leaves no room for ambiguity\n   regarding whether TLS or non-TLS will be used between the TACACS+\n   client and the TACACS+ server.\n\n   This document recommends the use of a separate port number that TLS\n   TACACS+ servers will listen to.  Where deployments have not\n   overridden the defaults explicitly, TACACS+ client implementations\n   MUST use the correct port values:\n\n   *  49: for non-TLS connection TACACS+\n\n   *  300: for TLS connection TACACS+\n\n   Implementors may offer a single option for TACACS+ clients and\n   servers to disable all non-TLS TACACS+ operations.  When enabled on a\n   TACACS+ server, it will not respond to any requests from non-TLS\n   TACACS+ client connections.  When enabled on a TACACS+ client, it\n   will not establish any non-TLS TACACS+ server connections.\n\n\n5.3. Well-Known TCP/IP Port Number\n\n   A new port number is considered appropriate (rather than a mechanism\n   that negotiates an upgrade from an initial non-TLS TACACS+\n   connection) because it allows:\n\n   *  ease of blocking the unobfuscated or obfuscated connections by the\n      TCP/IP port number,\n\n   *  passive Intrusion Detection Systems (IDSs) monitoring the\n      unobfuscated to be unaffected by the introduction of TLS,\n\n   *  avoidance of on-path attacks that can interfere with upgrade, and\n\n   *  prevention of the accidental exposure of sensitive information due\n      to misconfiguration.\n\n   However, the coexistence of inferior authentication and obfuscation,\n   whether a non-TLS connection or deprecated parts that compose TLS,\n   also presents an opportunity for downgrade attacks.  Causing failure\n   of connections to the TLS-enabled service or the negotiation of\n   shared algorithm support are two such downgrade attacks.\n\n   The simplest mitigation exposure from non-TLS connection methods is\n   to refuse non-TLS connections at the host entirely, perhaps using\n   separate hosts for non-TLS connections and TLS.\n\n   Another approach is mutual configuration that requires TLS.  TACACS+\n   clients and servers SHOULD support configuration that requires peers,\n   globally and individually, to use TLS.  Furthermore, peers SHOULD be\n   configurable to limit offered or recognized TLS versions and\n   algorithms to those recommended by standards bodies and implementers.\n\n\n6. Operational Considerations\n\n   Operational and deployment considerations are spread throughout the\n   document.  While avoiding repetition, it is useful for the impatient\n   to direct particular attention to Sections 5.2 and 5.1.5.  However,\n   it is important that the entire Section 5 is observed.\n\n   It is essential for operators to understand the implications of a TLS\n   certificate-based authentication solution, including the correct\n   handling of certificates, CAs, and all elements of TLS configuration.\n   Refer to [BCP195] for guidance.  Attention is drawn to the\n   provisioning of certificates to all peers, including TACACS+ TLS\n   clients, to permit the mandatory mutual authentication.\n\n6.1. Migration\n\n\n\n   Section 5.2 mentions that for an optimal deployment of TLS TACACS+,\n   TLS should be universally applied throughout the deployment.\n   However, during the migration process from a non-TLS TACACS+\n   deployment, operators may need to support both TLS and non-TLS\n   TACACS+ servers.  This migration phase allows operators to gradually\n   transition their deployments from an insecure state to a more secure\n   one, but it is important to note that it is vulnerable to downgrade\n   attacks.  Therefore, the migration phase should be considered\n   insecure until it is fully completed.  To mitigate this hazard:\n\n   *  The period where any client is configured with both TLS and non-\n      TLS TACACS+ servers should be minimized.\n\n   *  The operator must consider the security impact of supporting both\n      TLS and non-TLS connections, as mentioned above.\n\n\n6.2. Maintaining Non-TLS TACACS+ Clients\n\n   Some TACACS+ client devices in a deployment may not implement TLS.\n   These devices will require access to non-TLS TACACS+ servers.\n   Operators must follow the recommendation of Section 5.1.1 and deploy\n   separate non-TLS TACACS+ servers for these non-TLS clients from those\n   used for the TLS clients.\n\n\n6.3. YANG Model for TACACS+ Clients\n\n   [TACACS-YANG ] specifies a YANG model for managing TACACS+ clients,\n   including TLS support.\n\n\n7. IANA Considerations\n\n   IANA has allocated the following new well-known system in the\n   \"Service Name and Transport Protocol Port Number Registry\" (see\n   <https://www.iana.org/assignments/service-names-port-numbers >).  The\n   service name \"tacacss\" follows the common practice of appending an\n   \"s\" to the name given to the non-TLS well-known port name.  See the\n   justification for the allocation in Section 5.3.\n\n   Service Name:  tacacss\n   Port Number:  300\n   Transport Protocol:  TCP\n   Description:  TLS Secure Login Host Protocol (TACACSS)\n   Assignee:  IESG\n   Contact:  IETF Chair\n   Reference:  RFC 9887   Considerations about service discovery are out of scope of this\n   document.\n\n",
    "structured_content": {
      "1": {
        "title": "Introduction",
        "content": "   \"The Terminal Access Controller Access-Control System Plus (TACACS+)\n   Protocol\" [RFC8907] provides device administration for routers,\n   network access servers, and other networked computing devices via one\n   or more centralized TACACS+ servers.  The protocol provides\n   authentication, authorization, and accounting services (AAA) for\n   TACACS+ clients within the device administration use case.\n\n   The content of the protocol is highly sensitive and requires secure\n   transport to safeguard a deployment.  However, TACACS+ lacks\n   effective confidentiality, integrity, and authentication of the\n   connection and network traffic between the TACACS+ server and client.\n   The security mechanisms as described in Section 4.5 of [RFC8907] are\n   extremely weak.\n\n   To address these deficiencies, this document updates the TACACS+\n   protocol to use TLS 1.3 authentication and encryption [RFC8446], and\n   obsoletes the use of TACACS+ obfuscation mechanisms.  The maturity of\n   TLS in version 1.3 and above makes it a suitable choice for the\n   TACACS+ protocol.",
        "children": {}
      },
      "2": {
        "title": "Technical Definitions",
        "content": "   The terms defined in Section 3 of [RFC8907] are fully applicable here\n   and will not be repeated.  The following terms are also used in this\n   document.\n\n   Obfuscation:  TACACS+ was originally intended to incorporate a\n      mechanism for securing the body of its packets.  The algorithm is\n      categorized as obfuscation in Section 10.5.2 of [RFC8907].  The\n      term is used to ensure that the algorithm is not mistaken for\n      encryption.  It should not be considered secure.\n\n   Non-TLS connection:  This term refers to the connection defined in\n      [RFC8907].  It is a connection without TLS, using the unsecure\n      TACACS+ authentication and obfuscation (or the unobfuscated option\n      for testing).  The use of well-known TCP/IP host port number 49 is\n      specified as the default for non-TLS connections.\n\n   TLS connection:  A TLS connection is a TCP/IP connection with TLS\n      authentication and encryption used by TACACS+ for transport.  A\n      TLS connection for TACACS+ is always between one TACACS+ client\n      and one TACACS+ server.\n\n   TLS TACACS+ server:  This document describes a variant of the TACACS+\n      server, introduced in Section 3.2 of [RFC8907], which utilizes TLS\n      for transport, and makes some associated protocol optimizations.\n      Both server variants respond to TACACS+ traffic, but this document\n      specifically defines a TACACS+ server (whether TLS or non-TLS) as\n      being bound to a specific port number on a particular IP address\n      or hostname.  This definition is important in the context of the\n      configuration of TACACS+ clients to ensure they direct their\n      traffic to the correct TACACS+ servers.\n\n   Peer:  The peer of a TACACS+ client (or server) in the context of a\n      TACACS+ connection, is a TACACS+ server (or client).  Together,\n      the ends of a TACACS+ connection are referred to as peers.",
        "children": {
          "2.1": {
            "title": "Requirements Language",
            "content": "   The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\",\n   \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"NOT RECOMMENDED\", \"MAY\", and\n   \"OPTIONAL\" in this document are to be interpreted as described in BCP 14 [RFC2119] [RFC8174] when, and only when, they appear in all\n   capitals, as shown here.",
            "children": {}
          }
        }
      },
      "3": {
        "title": "TACACS+ over TLS",
        "content": "   TACACS+ over TLS takes the protocol defined in [RFC8907], removes the\n   option for obfuscation, and specifies that TLS 1.3 be used for\n   transport (Section 3.1 elaborates on TLS version support).  A new\n   well-known default host port number is used.  The next sections\n   provide further details and guidance.\n\n   TLS is introduced into TACACS+ to fulfill the following requirements:\n\n   1.  Confidentiality and Integrity: The MD5 algorithm underlying the\n       obfuscation mechanism specified in [RFC8907] has been shown to be\n       insecure [RFC6151] when used for encryption.  This prevents\n       TACACS+ from being used in a deployment compliant with\n       [FIPS-140-3].  Securing the TACACS+ protocol with TLS is intended\n       to provide confidentiality and integrity without requiring the\n       provision of a secured network.\n\n   2.  Peer authentication: The authentication capabilities of TLS\n       replace the shared secrets of obfuscation for mutual\n       authentication.\n\n   This document adheres to the recommendations in [REQ-TLS13].",
        "children": {
          "3.1": {
            "title": "Separating TLS Connections",
            "content": "   Peers implementing the TACACS+ protocol variant defined in this\n   document MUST apply mutual authentication and encrypt all data\n   exchanged between them.  Therefore, when a TCP connection is\n   established for the service, a TLS handshake begins immediately.\n   Options that upgrade an initial non-TLS connection MUST NOT be used;\n   see Section 5.3.\n\n   To ensure clear separation between TACACS+ traffic using TLS and that\n   which does not (see Section 5.3), servers supporting TACACS+ over TLS\n   MUST listen on a TCP/IP port distinct from that used by non-TLS\n   TACACS+ servers.  It is further RECOMMENDED to deploy the TLS and\n   non-TLS services on separate hosts, as discussed in Section 5.1.1.\n\n   Given the prevalence of default port usage in existing TACACS+ client\n   implementations, this specification assigns the well-known TCP port\n   number 300 for TACACS+ over TLS (see Section 7).\n\n   While the use of the designated port number is strongly encouraged,\n   deployments with specific requirements MAY use alternative TCP port\n   numbers.  In such cases, operators must carefully consider the\n   operational implications described in Section 5.3.",
            "children": {}
          },
          "3.2": {
            "title": "TLS Connection",
            "content": "   A TACACS+ client initiates a TLS connection by making a TCP\n   connection to a configured TLS TACACS+ server on the TACACS+ TLS port\n   number.  Once the TCP connection is established, the client MUST\n   immediately begin the TLS negotiation before sending any TACACS+\n   protocol data.\n\n   A minimum of TLS 1.3 [RFC8446] MUST be used for transport.  It is\n   expected that TACACS+, as described in this document, will work with\n   future versions of TLS.  Earlier versions of TLS MUST NOT be used.\n\n   Once the TLS connection has been successfully established, the\n   exchange of TACACS+ data MUST proceed in accordance with the\n   procedures defined in [RFC8907].  However, all TACACS+ messages SHALL\n   be transmitted as TLS application data.  The TACACS+ obfuscation\n   mechanism defined in [RFC8907] MUST NOT be applied when operating\n   over TLS (Section 4).\n\n   TLS TACACS+ connections are generally not long-lived.  The connection\n   will be closed by either a peer if it encounters an error or an\n   inactivity timeout.\n\n   For connections not operating in Single Connection Mode (as defined\n   in Section 4.3 of [RFC8907]), the TCP session SHALL be closed upon\n   completion of the associated TACACS+ session.  Connections operating\n   in Single Connection Mode MAY persist for a longer duration but are\n   typically subject to timeout and closure after a brief period of\n   inactivity.  Consequently, support for transport-layer keepalive\n   mechanisms is not required.\n\n   Why a connection is closed has no bearing on TLS resumption, unless\n   closed by a TLS error, in which case it is possible that the ticket\n   has been invalidated.\n\n   TACACS+ clients and servers widely support IPv6 configuration in\n   addition to IPv4.  This document makes no changes to recommendations\n   in this area.",
            "children": {}
          },
          "3.3": {
            "title": "TLS Authentication Options",
            "content": "   Implementations MUST support certificate-based mutual authentication,\n   to provide a core option for interoperability between deployments.\n   This authentication option is specified in Section 3.4.\n\n   In addition to certificate-based TLS authentication, implementations\n   MAY support the following alternative authentication mechanisms:\n\n   *  Pre-Shared Keys (PSKs) (Section 3.5), also known as external PSKs\n      in TLS 1.3.\n\n   *  Raw Public Keys (RPKs).  The details of RPKs are considered out of\n      scope for this document.  Refer to [RFC7250] and Section 4.4.2 of\n      [RFC8446] for implementation, deployment, and security\n      considerations.",
            "children": {}
          },
          "3.4": {
            "title": "TLS Certificate-Based Authentication",
            "content": "   TLS certificate authentication is the primary authentication option\n   for TACACS+ over TLS.  This section covers certificate-based\n   authentication only.\n\n   Deploying TLS certificate-based authentication correctly will\n   considerably improve the security of TACACS+ deployments.  It is\n   essential for implementers and operators to understand the\n   implications of a TLS certificate-based authentication solution,\n   including the correct handling of certificates, Certificate\n   Authorities (CAs), and all elements of TLS configuration.  For\n   guidance, start with [BCP195].\n\n   Each peer MUST validate the certificate path of its remote peer,\n   including revocation checking, as described in Section 3.4.1.\n\n   If the verification succeeds, the authentication is successful and\n   the connection is permitted.  Policy may impose further constraints\n   upon the peer, allowing or denying the connection based on\n   certificate fields or any other parameters exposed by the\n   implementation.\n\n   Unless disabled by configuration, a peer MUST NOT permit connection\n   of any peer that presents an invalid TLS certificate.",
            "children": {
              "3.4.1": {
                "title": "TLS Certificate Path Verification",
                "content": "   The implementation of certificate-based mutual authentication MUST\n   support certificate path validation as described in Section 6 of\n   [RFC5280].\n\n   In some deployments, a peer may be isolated from a remote peer's CA.\n   Implementations for these deployments MUST support certificate chains\n   (aka bundles or chains of trust), where the entire chain of the\n   remote peer's certificate is stored on the local peer.\n\n   TLS Cached Information Extension [RFC7924] SHOULD be implemented.\n   This MAY be augmented with RPKs [RFC7250], though revocation must be\n   handled as it is not part of that specification.\n\n   Other approaches may be used for loading the intermediate\n   certificates onto the client, but they MUST include support for\n   revocation checking.  For example, [RFC5280] details the Authority\n   Information Access (AIA) extension to provide information about the\n   issuer of the certificate in which the extension appears.  It can be\n   used to provide the address of the Online Certificate Status Protocol\n   (OCSP) responder from where the revocation status of the certificate\n   (which includes the extension) can be checked.",
                "children": {}
              },
              "3.4.2": {
                "title": "TLS Certificate Identification",
                "content": "   For the client-side validation of presented TLS TACACS+ server\n   identities, implementations MUST follow the validation techniques\n   defined in [RFC9525].  Identifier types DNS-ID, IP-ID, or SRV-ID are\n   applicable for use with the TLS TACACS+ protocol; they are selected\n   by operators depending upon the deployment design.  TLS TACACS+ does\n   not use URI-IDs for TLS TACACS+ server identity verification.\n\n   Wildcards in TLS TACACS+ server identities simplify certificate\n   management by allowing a single certificate to secure multiple\n   servers in a deployment.  However, this introduces security risks, as\n   compromising the private key of a wildcard certificate impacts all\n   servers using it.  To address these risks, the guidelines in Section 6.3 of [RFC9525] MUST be followed, and the wildcard SHOULD be\n   confined to a subdomain dedicated solely to TACACS+ servers.\n\n   For the TLS TACACS+ server-side validation of client identities,\n   implementations MUST support the ability to configure which fields of\n   a certificate are used for client identification to verify that the\n   client is a valid source for the received certificate and that it is\n   permitted access to TACACS+. Implementations MUST support either:\n\n   *  Network-address-based validation methods as described in Section 5.2 of [RFC5425] or\n\n   *  Client Identity validation of a shared identity in the certificate\n      subjectAltName.  This is applicable in deployments where the\n      client securely supports an identity which is shared with the TLS\n      TACACS+ server.  Matching of dNSName and iPAddress MUST be\n      supported.  Other options defined in Section 4.2.1.6 of [RFC5280]      MAY be supported.  This approach allows a client's network\n      location to be reconfigured without issuing a new client\n      certificate.\n\n   Implementations MUST support the TLS Server Name Indication (SNI)\n   extension (Section 3 of [RFC6066]).  TLS TACACS+ clients MUST support\n   the ability to configure the TLS TACACS+ server's domain name, so\n   that it may be included in the SNI \"server_name\" extension of the\n   client hello (This is distinct from the IP Address or hostname\n   configuration used for the TCP connection).  Refer to Section 5.1.5   for security related operator considerations.\n\n   Certificate provisioning is out of scope of this document.",
                "children": {}
              },
              "3.4.3": {
                "title": "Cipher Suites Requirements",
                "content": "   Implementations MUST support the TLS 1.3 mandatory cipher suites\n   (Section 9.1 of [RFC8446]).  Readers should refer to [BCP195].  The\n   cipher suites offered or accepted SHOULD be configurable so that\n   operators can adapt.",
                "children": {}
              }
            }
          },
          "3.5": {
            "title": "TLS PSK Authentication",
            "content": "   As an alternative to certificate-based authentication,\n   implementations MAY support PSKs, also known as external PSKs in TLS\n   1.3 [RFC8446].  These should not be confused with resumption PSKs.\n\n   The use of external PSKs is less well established than certificate-\n   based authentication.  It is RECOMMENDED that systems follow the\n   directions of [RFC9257] and Section 4 of [RFC8446].\n\n   Where PSK authentication is implemented, PSK lengths of at least 16\n   octets MUST be supported.\n\n   PSK identity MUST follow recommendations of Section 6.1 of [RFC9257].\n   Implementations MUST support PSK identities of at least 16 octets.\n\n   Although this document removes the option of obfuscation (Section 4),\n   it is still possible that the TLS and non-TLS versions of TACACS+\n   exist in an organization, for example, during migration\n   (Section 6.1).  In such cases, the shared secrets configured for\n   TACACS+ obfuscation clients MUST NOT be the same as the PSKs\n   configured for TLS clients.",
            "children": {}
          },
          "3.6": {
            "title": "TLS Resumption",
            "content": "   TLS Resumption [RFC8446] can minimize the number of round trips\n   required during the handshake process.  If a TLS client holds a\n   ticket previously extracted from a NewSessionTicket message from the\n   TLS TACACS+ server, it can use the PSK identity tied to that ticket.\n   If the TLS TACACS+ server consents, the resumed session is\n   acknowledged as authenticated and securely linked to the initial\n   session.\n\n   The client SHOULD use resumption when it holds a valid unused ticket\n   from the TLS TACACS+ server, as each ticket is intended for a single\n   use only and will be refreshed during resumption.  The TLS TACACS+\n   server can reject a resumption request, but the TLS TACACS+ server\n   SHOULD allow resumption if the ticket in question has not expired and\n   has not been used before.\n\n   When a TLS TACACS+ server is presented with a resumption request from\n   the TLS client, it MAY still choose to require a full handshake.  In\n   this case, the negotiation proceeds as if the session was a new\n   authentication, and the resumption attempt is ignored.  As described\n   in Appendix C.4 of [RFC8446], reuse of a ticket allows passive\n   observers to correlate different connections.  TLS TACACS+ clients\n   and servers SHOULD follow the client tracking preventions in Appendix C.4 of [RFC8446].\n\n   When processing TLS resumption, certificates must be verified to\n   check for revocation during the period since the last\n   NewSessionTicket Message.\n\n   The resumption ticket_lifetime SHOULD be configurable, including a\n   zero seconds lifetime.  Refer to Section 4.6.1 of [RFC8446] for\n   guidance on ticket lifetime.",
            "children": {}
          }
        }
      },
      "4": {
        "title": "Obsolescence of TACACS+ Obfuscation",
        "content": "   The obfuscation mechanism documented in Section 4.5 of [RFC8907] is\n   weak.\n\n   The introduction of TLS authentication and encryption to TACACS+\n   replaces this former mechanism, so obfuscation is hereby obsoleted.\n   This section describes how the TACACS+ client and servers MUST\n   operate regarding the obfuscation mechanism.\n\n   Peers MUST NOT use obfuscation with TLS.\n\n   A TACACS+ client initiating a TACACS+ TLS connection MUST set the\n   TAC_PLUS_UNENCRYPTED_FLAG bit, thereby asserting that obfuscation is\n   not used for the session.  All subsequent packets MUST have the\n   TAC_PLUS_UNENCRYPTED_FLAG bit set to 1.\n\n   A TLS TACACS+ server that receives a packet with the\n   TAC_PLUS_UNENCRYPTED_FLAG bit not set to 1 over a TLS connection MUST\n   return an error of TAC_PLUS_AUTHEN_STATUS_ERROR,\n   TAC_PLUS_AUTHOR_STATUS_ERROR, or TAC_PLUS_ACCT_STATUS_ERROR as\n   appropriate for the TACACS+ message type, with the\n   TAC_PLUS_UNENCRYPTED_FLAG bit set to 1, and terminate the session.\n   This behavior corresponds to that defined in Section 4.5 of [RFC8907]   regarding data obfuscation for TAC_PLUS_UNENCRYPTED_FLAG or key\n   mismatches.\n\n   A TACACS+ client that receives a packet with the\n   TAC_PLUS_UNENCRYPTED_FLAG bit not set to 1 MUST terminate the\n   session, and SHOULD log this error.",
        "children": {}
      },
      "5": {
        "title": "Security Considerations",
        "content": "\n\n",
        "children": {
          "5.1": {
            "title": "TLS",
            "content": "   This document improves the confidentiality, integrity, and\n   authentication of the connection and network traffic between TACACS+\n   peers by adding TLS support.\n\n   Simply adding TLS support to the protocol does not guarantee the\n   protection of the TLS TACACS+ server and clients.  It is essential\n   for the operators and equipment vendors to adhere to the latest best\n   practices for ensuring the integrity of network devices and selecting\n   secure TLS key and encryption algorithms.\n\n   [BCP195] offers substantial guidance for implementing and deploying\n   protocols that use TLS.  Those implementing and deploying Secure\n   TACACS+ must adhere to the recommendations relevant to TLS 1.3\n   outlined in [BCP195] or its subsequent versions.\n\n   This document outlines additional restrictions permissible under\n   [BCP195].  For example, any recommendations referring to TLS 1.2,\n   including the mandatory support, are not relevant for Secure TACACS+,\n   as TLS 1.3 or above is mandated.\n\n   This document concerns the use of TLS as transport for TACACS+ and\n   does not make any changes to the core TACACS+ protocol, other than\n   the direct implications of deprecating obfuscation.  Operators MUST\n   be cognizant of the security implications of the TACACS+ protocol\n   itself.  Further documents are planned, for example, to address the\n   security implications of password-based authentication and enhance\n   the protocol to accommodate alternative schemes.",
            "children": {
              "5.1.1": {
                "title": "TLS Use",
                "content": "   New TACACS+ production deployments SHOULD use TLS authentication and\n   encryption.  Also see [RFC3365].\n\n   TLS TACACS+ servers (as defined in Section 2) MUST NOT allow non-TLS\n   connections, because of the threat of downgrade attacks or\n   misconfiguration described in Section 5.3.  Instead, separate non-TLS\n   TACACS+ servers SHOULD be set up to cater for these clients.\n\n   It is NOT RECOMMENDED that TLS TACACS+ servers and non-TLS TACACS+\n   servers be deployed on the same host, for reasons discussed in Section 5.3.  Non-TLS connections would be better served by deploying\n   the required non-TLS TACACS+ servers on separate hosts.\n\n   TACACS+ clients MUST NOT fail back to a non-TLS connection if a TLS\n   connection fails.  This prohibition includes during the migration of\n   a deployment (Section 6.1).",
                "children": {}
              },
              "5.1.2": {
                "title": "TLS 0-RTT",
                "content": "   TLS 1.3 resumption and PSK techniques make it possible to send early\n   data, aka 0-RTT data, data that is sent before the TLS handshake\n   completes.  Replay of this data is a risk.  Given the sensitivity of\n   TACACS+ data, clients MUST NOT send data until the full TLS handshake\n   completes; that is, clients MUST NOT send 0-RTT data and TLS TACACS+\n   servers MUST abruptly disconnect clients that do.\n\n   TLS TACACS+ clients and servers MUST NOT include the \"early_data\"\n   extension.  See Sections 2.3 and 4.2.10 of [RFC8446] for security\n   concerns.",
                "children": {}
              },
              "5.1.3": {
                "title": "TLS Options",
                "content": "   Recommendations in [BCP195] MUST be followed to determine which TLS\n   versions and algorithms should be supported, deprecated, obsoleted,\n   or abandoned.\n\n   Also, Section 9 of [RFC8446] prescribes mandatory supported options.",
                "children": {}
              },
              "5.1.4": {
                "title": "Unreachable Certificate Authority (CA)",
                "content": "   Operators should be cognizant of the potential of TLS TACACS+ server\n   and/or client isolation from their peer's CA by network failures.\n   Isolation from a public key certificate's CA will cause the\n   verification of the certificate to fail and thus TLS authentication\n   of the peer to fail.  The approach mentioned in Section 3.4.1 can\n   help address this and should be considered.",
                "children": {}
              },
              "5.1.5": {
                "title": "TLS Server Name Indicator (SNI)",
                "content": "   Operators should be aware that the TLS SNI extension is part of the\n   TLS client hello, which is sent in cleartext.  It is, therefore,\n   subject to eavesdropping.  Also see Section 11.1 of [RFC6066].",
                "children": {}
              },
              "5.1.6": {
                "title": "Server Identity Wildcards",
                "content": "   The use of wildcards in TLS server identities creates a single point\n   of failure: a compromised private key of a wildcard certificate\n   impacts all servers using it.  Their use MUST follow the\n   recommendations of Section 7.1 of [RFC9525].  Operators MUST ensure\n   that the wildcard is limited to a subdomain dedicated solely to TLS\n   TACACS+ servers.  Further, operators MUST ensure that the TLS TACACS+\n   servers covered by a wildcard certificate are impervious to\n   redirection of traffic to a different server (for example, due to on-\n   path attacks or DNS cache poisoning).",
                "children": {}
              }
            }
          },
          "5.2": {
            "title": "TACACS+ Configuration",
            "content": "   Implementors must ensure that the configuration scheme introduced for\n   enabling TLS is straightforward and leaves no room for ambiguity\n   regarding whether TLS or non-TLS will be used between the TACACS+\n   client and the TACACS+ server.\n\n   This document recommends the use of a separate port number that TLS\n   TACACS+ servers will listen to.  Where deployments have not\n   overridden the defaults explicitly, TACACS+ client implementations\n   MUST use the correct port values:\n\n   *  49: for non-TLS connection TACACS+\n\n   *  300: for TLS connection TACACS+\n\n   Implementors may offer a single option for TACACS+ clients and\n   servers to disable all non-TLS TACACS+ operations.  When enabled on a\n   TACACS+ server, it will not respond to any requests from non-TLS\n   TACACS+ client connections.  When enabled on a TACACS+ client, it\n   will not establish any non-TLS TACACS+ server connections.",
            "children": {}
          },
          "5.3": {
            "title": "Well-Known TCP/IP Port Number",
            "content": "   A new port number is considered appropriate (rather than a mechanism\n   that negotiates an upgrade from an initial non-TLS TACACS+\n   connection) because it allows:\n\n   *  ease of blocking the unobfuscated or obfuscated connections by the\n      TCP/IP port number,\n\n   *  passive Intrusion Detection Systems (IDSs) monitoring the\n      unobfuscated to be unaffected by the introduction of TLS,\n\n   *  avoidance of on-path attacks that can interfere with upgrade, and\n\n   *  prevention of the accidental exposure of sensitive information due\n      to misconfiguration.\n\n   However, the coexistence of inferior authentication and obfuscation,\n   whether a non-TLS connection or deprecated parts that compose TLS,\n   also presents an opportunity for downgrade attacks.  Causing failure\n   of connections to the TLS-enabled service or the negotiation of\n   shared algorithm support are two such downgrade attacks.\n\n   The simplest mitigation exposure from non-TLS connection methods is\n   to refuse non-TLS connections at the host entirely, perhaps using\n   separate hosts for non-TLS connections and TLS.\n\n   Another approach is mutual configuration that requires TLS.  TACACS+\n   clients and servers SHOULD support configuration that requires peers,\n   globally and individually, to use TLS.  Furthermore, peers SHOULD be\n   configurable to limit offered or recognized TLS versions and\n   algorithms to those recommended by standards bodies and implementers.",
            "children": {}
          }
        }
      },
      "6": {
        "title": "Operational Considerations",
        "content": "   Operational and deployment considerations are spread throughout the\n   document.  While avoiding repetition, it is useful for the impatient\n   to direct particular attention to Sections 5.2 and 5.1.5.  However,\n   it is important that the entire Section 5 is observed.\n\n   It is essential for operators to understand the implications of a TLS\n   certificate-based authentication solution, including the correct\n   handling of certificates, CAs, and all elements of TLS configuration.\n   Refer to [BCP195] for guidance.  Attention is drawn to the\n   provisioning of certificates to all peers, including TACACS+ TLS\n   clients, to permit the mandatory mutual authentication.",
        "children": {
          "6.1": {
            "title": "Migration",
            "content": "\n\n   Section 5.2 mentions that for an optimal deployment of TLS TACACS+,\n   TLS should be universally applied throughout the deployment.\n   However, during the migration process from a non-TLS TACACS+\n   deployment, operators may need to support both TLS and non-TLS\n   TACACS+ servers.  This migration phase allows operators to gradually\n   transition their deployments from an insecure state to a more secure\n   one, but it is important to note that it is vulnerable to downgrade\n   attacks.  Therefore, the migration phase should be considered\n   insecure until it is fully completed.  To mitigate this hazard:\n\n   *  The period where any client is configured with both TLS and non-\n      TLS TACACS+ servers should be minimized.\n\n   *  The operator must consider the security impact of supporting both\n      TLS and non-TLS connections, as mentioned above.",
            "children": {}
          },
          "6.2": {
            "title": "Maintaining Non-TLS TACACS+ Clients",
            "content": "   Some TACACS+ client devices in a deployment may not implement TLS.\n   These devices will require access to non-TLS TACACS+ servers.\n   Operators must follow the recommendation of Section 5.1.1 and deploy\n   separate non-TLS TACACS+ servers for these non-TLS clients from those\n   used for the TLS clients.",
            "children": {}
          },
          "6.3": {
            "title": "YANG Model for TACACS+ Clients",
            "content": "   [TACACS-YANG ] specifies a YANG model for managing TACACS+ clients,\n   including TLS support.",
            "children": {}
          }
        }
      },
      "7": {
        "title": "IANA Considerations",
        "content": "   IANA has allocated the following new well-known system in the\n   \"Service Name and Transport Protocol Port Number Registry\" (see\n   <https://www.iana.org/assignments/service-names-port-numbers >).  The\n   service name \"tacacss\" follows the common practice of appending an\n   \"s\" to the name given to the non-TLS well-known port name.  See the\n   justification for the allocation in Section 5.3.\n\n   Service Name:  tacacss\n   Port Number:  300\n   Transport Protocol:  TCP\n   Description:  TLS Secure Login Host Protocol (TACACSS)\n   Assignee:  IESG\n   Contact:  IETF Chair\n   Reference:  RFC 9887   Considerations about service discovery are out of scope of this\n   document.",
        "children": {},
        "decomposed_content": [
          {
            "text": "   IANA has allocated the following new well-known system in the\n   \"Service Name and Transport Protocol Port Number Registry\" (see\n   <https://www.iana.org/assignments/service-names-port-numbers >).  The\n   service name \"tacacss\" follows the common practice of appending an\n   \"s\" to the name given to the non-TLS well-known port name.  See the\n   justification for the allocation in Section 5.3.",
            "references": [
              {
                "rfc_number": "RFC9887",
                "section_id": "5.3"
              }
            ],
            "external_references": []
          },
          {
            "text": "   Service Name:  tacacss\n   Port Number:  300\n   Transport Protocol:  TCP\n   Description:  TLS Secure Login Host Protocol (TACACSS)\n   Assignee:  IESG\n   Contact:  IETF Chair\n   Reference:  RFC 9887   Considerations about service discovery are out of scope of this\n   document.",
            "references": [],
            "external_references": []
          }
        ]
      }
    }
  }
]